# terminal
brew "direnv" # per-directory env vars
cask "ghostty"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
brew "doctl"
brew "fzf"
brew "gh"
brew "git"
brew "kustomize"
brew "starship"
brew "tree"
brew "jq"

# business
brew "hledger"

# rust
brew "libffi"

# cloud
cask "ngrok"
cask "postman"

# ai
tap "anomalyco/tap"
brew "anomalyco/tap/opencode"
cask "codex"
brew "gemini-cli"
cask "claude-code"
cask "superwhisper" # voice dictation for ai prompts

# people work dependencies
brew "aqua" # per-project CLI tool manager
brew "colima" # container runtime for tests and local db
brew "docker" # CLI only, desktop replaced by colima
brew "docker-compose" # multi-container orchestration
brew "libyaml" # yaml parsing for ruby gems
brew "mise" # polyglot tool version manager
brew "rustup" # rust toolchain manager
brew "shellcheck"

# swift
brew "ruby-install"
brew "xcodegen"
brew "xcode-build-server"

# web
cask "google-chrome"
brew "node@24"
brew "pnpm"
tap "oven-sh/bun"
brew "bun"
brew "imagemagick"

# java / android
brew "gradle"
brew "openjdk@21"
cask "android-studio"

# macOS
cask "slack"
brew "fonttools"

# vscode
cask "visual-studio-code"
vscode "alexcvzz.vscode-sqlite"
vscode "bierner.color-info"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "bioinfo.markitdown-vscode"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-vscode.makefile-tools"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vadimcn.vscode-lldb"
