# terminal
cask "ghostty"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
tap "steveyegge/beads"
brew "doctl"
brew "fzf"
brew "gh"
brew "git"
brew "kustomize"
brew "starship"
brew "tree"
brew "jq"

# rust
brew "cargo-binstall"
brew "cargo-nextest"
brew "just"
brew "libffi"
brew "rustup"

# cloud
brew "doctl"
brew "kubernetes-cli"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
cask "ngrok"
cask "postman"
brew "stripe/stripe-cli/stripe"
brew "tflint"

# python
brew "uv" # manages python, packages, and virtual environments

# ai
brew "steveyegge/beads/bd" # ai task automation
cask "superwhisper" # voice dictation for ai prompts

# swift
brew "fastlane"
brew "ruby-install"
brew "swiftformat"
brew "swiftlint"
brew "xcodegen"
brew "xcode-build-server"

# web
cask "google-chrome"
brew "node@24"
brew "pnpm"
tap "oven-sh/bun"
brew "bun"
brew "zola"
brew "imagemagick"

# macOS
cask "slack"
brew "fonttools"

# vscode
cask "visual-studio-code"
vscode "a11ywatch.vscode-a11ywatch-extension"
vscode "alexcvzz.vscode-sqlite"
vscode "bierner.color-info"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-vscode.makefile-tools"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "rust-lang.rust-analyzer"
vscode "sswg.swift-lang"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
